# lessons.py

LESSONS = {
    "سنة أولى": {
        "بدون تخصص": {
            "السداسي الأول": {
                "عقيدة 1": [],
                "أصول الفقه 2": [
                    ("📄 أصول الفقه (PDF)", "BQACAgQAAxkBAAFCdVppkSyO6VHdxF8ju9IZ013053RjjQACAxsAArDnUVK8c5NmO0Az0ToE"),
                ],
                "فقه العبادات 1": [],
                "لغة عربية": [],
                "علوم القرآن": [],
                "تاريخ إسلامي": [],
                "علوم التربية": [],
                "منهجية البحث": [],
                "لغة انجليزية": [],
                "إعلام الي": [],
                "ترتيل وحفظ القرآن": [
                    ("📄 ترتيل وحفظ القرآن (PDF)", "BQACAgQAAxkBAAFCdXJpkS0qnkM5bJJcexPHoq8KkfeSfgAC9xkAAudO2VDXIIxmhSA2uzoE"),
                ],
            },
            "السداسي الثاني": {
                "عقيدة 1": [],
                "فقه العبادات 2": [],
                "لغة عربية": [],
                "ترتيل و حفظ القرآن": [],
                "علوم الحديث": [],
                "العلوم القانونية": [],
                "تاريخ إسلامي": [],
                "علم الدعوة": [],
                "مقارنة أديان": [],
                "لغة انجليزية": [],
                "إعلام الي": [],
            },
        }
    },

    "سنة ثانية": {
        "شعبة أصول الفقه": {
            "السداسي الثالث": {
                "ترتيل و حفظ القرآن": [],
                "اصول الفقه": [],
                "فقه المعاملات": [],
                "نظرية الحق": [],
                "مدخل إلى حقوق الإنسان": [],
                "مناهج البحث في الشريعة": [],
                "ايات الأحكام": [],
                "السياسة الشرعية": [],
                "نحو و صرف": [],
                "فكر إسلامي": [],
                "لغة اجنبية": [],
            },
            "السداسي الرابع": {
                "ترتيل وحفظ القرآن": [],
                "اصول الفقه": [],
                "فقه الأسرة": [],
                "نظرية الالتزام": [],
                "مالية عامة": [],
                "تاريخ التشريع": [],
                "القواعد الفقهية": [],
                "القانون الدستوري": [],
                "البلاغة": [],
                "الحضارة الإسلامية": [],
                "لغة اجنبية": [],
            },
        },

        "شعبة اصول الدين": {
            "السداسي الثالث": {
                "ترتيل وحفظ القرآن": [],
                "العقيدة الإسلامية": [],
                "حديث تحليلي": [],
                "تفسير تحليلي": [],
                "مناهج الدعوة": [],
                "المنطق و مناهج البحث": [],
                "الفكر الإسلامي": [],
                "اصول الفقه": [],
                "فقه الأسرة": [],
                "نحو و صرف": [],
                "لغة اجنبية": [],
            },
            "السداسي الرابع": {
                "ترتيل وحفظ القرآن": [],
                "العقيدة الإسلامية": [],
                "مناهج المحدثين": [],
                "مناهج المفسرين": [],
                "مقارنة أديان": [],
                "الأصول المنهجية الفرق الإسلامية": [],
                "منهجية تخريج الحديث": [],
                "أعلام الدعوة": [],
                "فقه المعاملات": [],
                "البلاغة": [],
                "لغة اجنبية": [],
            },
        },
    },
}
