LESSONS = {

    "سنة أولى": {
        "بدون تخصص": {

            "السداسي الأول": {
                "عقيدة 1": [],
                "أصول الفقه 2": [],
                "فقه العبادات 1": [],
                "لغة عربية": [],
                "علوم القرآن": [],
                "تاريخ إسلامي": [],
                "علوم التربية": [],
                "منهجية البحث": [],
                "لغة إنجليزية": [],
                "إعلام آلي": [],
                "ترتيل وحفظ القرآن": []
            },

            "السداسي الثاني": {
                "عقيدة 1": [],
                "فقه العبادات 2": [],
                "لغة عربية": [],
                "ترتيل وحفظ القرآن": [],
                "علوم الحديث": [],
                "العلوم القانونية": [],
                "تاريخ إسلامي": [],
                "علم الدعوة": [],
                "مقارنة أديان": [],
                "لغة إنجليزية": [],
                "إعلام آلي": []
            }
        }
    },

    "سنة ثانية": {

        "شعبة أصول الفقه": {

            "السداسي الثالث": {
                "ترتيل وحفظ القرآن": [],
                "أصول الفقه": [],
                "فقه المعاملات": [],
                "نظرية الحق": [],
                "مدخل إلى حقوق الإنسان": [],
                "مناهج البحث في الشريعة": [],
                "آيات الأحكام": [],
                "السياسة الشرعية": [],
                "نحو وصرف": [],
                "فكر إسلامي": [],
                "لغة أجنبية": []
            },

            "السداسي الرابع": {
                "ترتيل وحفظ القرآن": [],
                "أصول الفقه": [],
                "فقه الأسرة": [],
                "نظرية الالتزام": [],
                "مالية عامة": [],
                "تاريخ التشريع": [],
                "القواعد الفقهية": [],
                "القانون الدستوري": [],
                "البلاغة": [],
                "الحضارة الإسلامية": [],
                "لغة أجنبية": []
            }
        },

        "شعبة أصول الدين": {

            "السداسي الثالث": {
                "ترتيل وحفظ القرآن": [],
                "العقيدة الإسلامية": [],
                "حديث تحليلي": [],
                "تفسير تحليلي": [],
                "مناهج الدعوة": [],
                "المنطق ومناهج البحث": [],
                "الفكر الإسلامي": [],
                "أصول الفقه": [],
                "فقه الأسرة": [],
                "نحو وصرف": [],
                "لغة أجنبية": []
            },

            "السداسي الرابع": {
                "ترتيل وحفظ القرآن": [],
                "العقيدة الإسلامية": [],
                "مناهج المحدثين": [],
                "مناهج المفسرين": [],
                "مقارنة أديان": [],
                "الأصول المنهجية للفرق الإسلامية": [],
                "منهجية تخريج الحديث": [],
                "أعلام الدعوة": [],
                "فقه المعاملات": [],
                "البلاغة": [],
                "لغة أجنبية": []
            }
        }

    }

}
